---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointFlexibleOrientationType
source: html/9010b31a-1c22-7cb8-e0f2-a753d564ec48.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointFlexibleOrientationType Property

"Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId PointFlexibleOrientationType { get; }
```